Revit 2026 API

# ViewGetDepthCueing Method

---

Returns the current depth cueing settings for the view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ViewDisplayDepthCueing GetDepthCueing()
```
```vb
Public Function GetDepthCueing As ViewDisplayDepthCueing
```
```cpp
public:
ViewDisplayDepthCueing^ GetDepthCueing()
```
```fsharp
member GetDepthCueing : unit -> ViewDisplayDepthCueing
```

#### Return Value

ViewDisplayDepthCueing Current depth cueing settings.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This view cannot use Depth Cueing |

#### Reference

View Class

Autodesk.Revit.DB Namespace